ci4/app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi'),
            'slug'  => url_title($this->request->getVar('judul')),
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel Test Api\n', NULL, 'Artikel-Test-Api')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '14'
 LIMIT 1