ci4/app/Controllers/Api/auth.php

SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1
SELECT *
FROM `user`
WHERE `username` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $login = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();
        $user = $model->where('useremail', $login)->first();

        if (!$user) {
            $user = $model->where('username', $login)->first();